* DONE JZOJ 5970
** DONE think
   CLOCK: [2019-02-15 五 14:45]--[2019-02-15 五 15:32] =>  0:47
** DONE code
   CLOCK: [2019-02-15 五 15:32]--[2019-02-15 五 16:22] =>  0:50
* DONE JZOJ 5971
** DONE think
   CLOCK: [2019-02-15 五 18:28]--[2019-02-15 五 18:58] =>  0:30
   CLOCK: [2019-02-15 五 17:27]--[2019-02-15 五 18:16] =>  0:49
** DONE code
   CLOCK: [2019-02-15 五 19:18]--[2019-02-15 五 20:07] =>  0:49
